In [1]:
import pandas as pd

In [5]:
log = pd.read_csv('log.csv')

In [7]:
log.head()

,Запись пользователя № - user_919,[2019-01-01 14:06:51,Unnamed: 2,Unnamed: 3
0,Запись пользователя № - user_973,[2019-01-01 14:51:16,NaN,NaN
1,Запись пользователя № - user_903,[2019-01-01 16:31:16,NaN,NaN
2,Запись пользователя № - user_954,[2019-01-01 17:17:51,NaN,NaN
3,Запись пользователя № - user_954,[2019-01-01 21:31:18,NaN,NaN
4,Запись пользователя № - user_917,[2019-01-01 23:34:55,156789.0,NaN

In [12]:
log = pd.read_csv('log.csv', header=None)
log.head()

                                  0                     1   2   3
0  Запись пользователя № - user_919  [2019-01-01 14:06:51 NaN NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16 NaN NaN
2  Запись пользователя № - user_903  [2019-01-01 16:31:16 NaN NaN
3  Запись пользователя № - user_954  [2019-01-01 17:17:51 NaN NaN
4  Запись пользователя № - user_954  [2019-01-01 21:31:18 NaN NaN

Загрузите файл sample.csv в переменную sample, сохраните колонки в переменную columns:

In [17]:
sample = pd.read_csv('sample.csv')
columns = sample.columns

Создайте в sample заголовки колонок так, чтобы там были только маленькие буквы. Например, вместо 'Age' нужно сделать 'age':

In [36]:
sample = pd.read_csv('sample.csv')
sample.columns = [column.lower() for column in sample.columns]

In [34]:
sample = pd.read_csv('sample.csv')
sample.columns = list(map(lambda column: column.lower(),sample.columns))

Давайте применим полученные знания для нашего датафрейма: замените в log заголовки колонок на:
- user_id
- time
- bet
- win

In [41]:
log = pd.read_csv("log.csv", header=None)
log.columns = ['user_id','time','bet','win']

Давайте перейдем ко второму файлу users.csv. Его импортировали из старой версии Excel у системного администратора, и, по словам Коли, многие не смогли его открыть. Загрузите файл в переменную users. Не открывается сразу? Попробуйте открыть его в текстовом редакторе и разобраться, что с ним не так.

Посмотрите, какие параметры есть у функции read_csv: в чём может быть ошибка?

С помощью правильных параметров read_csv загрузите датафрейм:

In [50]:
# https://docs.python.org/2.4/lib/standard-encodings.html

In [67]:
users = pd.read_csv('users.csv',sep='\t', encoding = 'koi8_r')

In [69]:
users.head()

     Юзверь                 мейл        Гео
0  User_943  Accumanst@gmail.com     Ижевск
1  User_908    Advismowr@mail.ru     Ижевск
2  User_962      Anachso@ukr.net  Краснодар
3  User_973     Antecia@inbox.ru      Пермь
4  User_902   Balliaryva@ukr.net        NaN

Прочитайте файл в переменную users. Замените в нём названия колонок на:
- user_id
- email
- geo

In [70]:
users = pd.read_csv('users.csv',sep='\t', encoding = 'koi8_r')
users.columns = ['user_id','email','geo']

In [71]:
users.head()

    user_id                email        geo
0  User_943  Accumanst@gmail.com     Ижевск
1  User_908    Advismowr@mail.ru     Ижевск
2  User_962      Anachso@ukr.net  Краснодар
3  User_973     Antecia@inbox.ru      Пермь
4  User_902   Balliaryva@ukr.net        NaN

Очистка данных
Перейдём к очистке данных. На этом этапе нужно тщательно изучить сами данные, а именно:

формат представления данных,
ошибки в данных,
пропущенные значения,
дубликаты,
типы данных (числа, строки, даты).
Давайте посмотрим на качество данных. Насколько они валидны? Есть ли пропущенные значения? Есть ли проблема с форматом данных? Просмотрите данные: что вам удалось обнаружить?

Один из самых простых способов просмотреть данные — это воспользоваться функцией .unique(), которая выдаёт список уникальных значений колонки.

Посмотрите все уникальные значения в sample.csv.

Какие ошибки вы видете в колонке Name?

In [74]:
[sample[column] for column in sample.columns]

[0           Иванов
 1              NaN
 2           Иванов
 3          sidorov
 4          _______
 5         Кузнецов
 6            Сажин
 7     Котлеревский
 8       Завалишина
 9           Левина
 10            Фикс
 Name: name, dtype: object, 0          Москва
 1       Волгоград
 2          Москва
 3     Владивосток
 4           Курск
 5            Сочи
 6          Сургут
 7      Йошкар-Ола
 8       Чебоксары
 9             NaN
 10           Рига
 Name: city, dtype: object, 0     25
 1     31
 2     25
 3     43
 4     50
 5     19
 6     29
 7     32
 8     36
 9     55
 10    42
 Name: age, dtype: int64, 0       Клинер
 1     Менеджер
 2       Клинер
 3     Менеджер
 4     Водитель
 5      Рабочий
 6      Рабочий
 7      Рабочий
 8     Менеджер
 9      Рабочий
 10     Рабочий
 Name: profession, dtype: object]

Посмотрите, сколько непустых значений в колонке City.

In [84]:
sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
name          10 non-null object
city          10 non-null object
age           11 non-null int64
profession    11 non-null object
dtypes: int64(1), object(3)
memory usage: 432.0+ bytes

Поработаем с log.csv. В колонке user_id есть записи, которые содержат технические ошибки. Укажите, что записано в поле user_id в строчках с ошибкой:

In [79]:
log.user_id.unique()

array(['Запись пользователя № - user_919',
       'Запись пользователя № - user_973',
       'Запись пользователя № - user_903',
       'Запись пользователя № - user_954',
       'Запись пользователя № - user_917',
       'Запись пользователя № - user_900',
       'Запись пользователя № - user_980',
       'Запись пользователя № - user_906',
       'Запись пользователя № - user_952',
       'Запись пользователя № - user_972',
       'Запись пользователя № - user_966',
       'Запись пользователя № - user_964',
       'Запись пользователя № - user_978',
       'Запись пользователя № - user_968',
       'Запись пользователя № - user_974',
       'Запись пользователя № - user_998',
       'Запись пользователя № - user_990',
       'Запись пользователя № - user_942',
       'Запись пользователя № - user_929',
       'Запись пользователя № - user_976',
       'Запись пользователя № - user_927',
       'Запись пользователя № - user_951',
       'Запись пользователя № - user_949',
       'Запись пользователя № - user_987',
       'Запись пользователя № - user_985',
       'Запись пользователя № - user_992',
       'Запись пользователя № - user_937',
       'Запись пользователя № - user_913',
       'Запись пользователя № - user_948',
       'Запись пользователя № - user_916',
       'Запись пользователя № - user_938',
       'Запись пользователя № - user_997',
       'Запись пользователя № - user_940',
       'Запись пользователя № - user_918',
       'Запись пользователя № - user_960',
       'Запись пользователя № - user_905',
       'Запись пользователя № - user_924',
       'Запись пользователя № - user_958',
       'Запись пользователя № - user_920',
       'Запись пользователя № - user_943',
       'Запись пользователя № - user_935',
       'Запись пользователя № - user_915',
       'Запись пользователя № - user_921',
       'Запись пользователя № - user_999',
       'Запись пользователя № - user_982',
       'Запись пользователя № - user_928',
       'Запись пользователя № - user_944',
       'Запись пользователя № - user_912',
       'Запись пользователя № - user_969',
       'Запись пользователя № - user_901',
       'Запись пользователя № - user_995',
       'Запись пользователя № - user_933',
       'Запись пользователя № - user_986',
       'Запись пользователя № - user_971',
       'Запись пользователя № - user_977',
       'Запись пользователя № - user_979',
       'Запись пользователя № - user_910',
       'Запись пользователя № - user_994',
       'Запись пользователя № - user_907',
       'Запись пользователя № - user_941',
       'Запись пользователя № - user_989',
       'Запись пользователя № - user_955',
       'Запись пользователя № - user_991',
       'Запись пользователя № - user_996',
       'Запись пользователя № - user_926',
       'Запись пользователя № - user_984',
       'Запись пользователя № - user_957',
       'Запись пользователя № - user_914',
       'Запись пользователя № - user_988',
       'Запись пользователя № - user_923',
       'Запись пользователя № - user_967',
       'Запись пользователя № - user_945',
       'Запись пользователя № - user_993',
       'Запись пользователя № - user_908',
       'Запись пользователя № - user_930',
       'Запись пользователя № - user_981',
       'Запись пользователя № - user_936',
       'Запись пользователя № - user_922',
       'Запись пользователя № - user_962',
       'Запись пользователя № - user_965',
       'Запись пользователя № - user_959',
       'Запись пользователя № - user_963',
       'Запись пользователя № - user_904',
       'Запись пользователя № - user_931',
       'Запись пользователя № - user_1000',
       'Запись пользователя № - user_946',
       'Запись пользователя № - user_970',
       'Запись пользователя № - user_939',
       'Запись пользователя № - user_961',
       'Запись пользователя № - user_911',
       'Запись пользователя № - user_950',
       'Запись пользователя № - user_956',
       'Запись пользователя № - user_909',
       'Запись пользователя № - user_983',
       'Запись пользователя № - user_902',
       'Запись пользователя № - user_947',
       'Запись пользователя № - user_975',
       'Запись пользователя № - user_953',
       'Запись пользователя № - user_925',
       'Запись пользователя № - user_934',
       'Запись пользователя № - user_932', '#error'], dtype=object)

Потренируемся на sample.csv.

Создайте новый датафрейм sample2, в который будут входить только записи о людях в возрасте меньше 30 лет.

In [89]:
sample = pd.read_csv("sample.csv")
sample2 = sample[sample.Age < 30]

Создайте новый датафрейм log_win, в который будут входить только записи, где пользователь выиграл. Посчитайте, сколько таких записей, и сохраните в переменной win_count.

In [97]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log_win = log[log.win.notna()]
win_count = log.win.count()

Создайте новый датафрейм sample2, в который будут входить только записи о рабочих младше 30 лет.

In [99]:
sample = pd.read_csv("sample.csv")
sample2 = sample[(sample.Age < 30) & (sample.Profession == 'Рабочий')]

       Name    City  Age Profession
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

Pandas помогает фильтровать значения без создания циклов, главное — сформулировать, что именно ты ищешь. Наиболее мощный и удобный способ проводить фильтрацию — использовать функцию query. Она позволяет писать сложные запросы к датафрейму. Если вы работали с SQL-запросами, то принцип работы query будет вам понятен.

Среди запросов может быть сравнение. В примере мы получаем все элементы, для которых возраст больше 20:

In [103]:
sample.query('Age>20')

            Name         City  Age Profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [104]:
sample.query('City in ["Рига","Сочи"]')

        Name  City  Age Profession
5   Кузнецов  Сочи   19    Рабочий
10      Фикс  Рига   42    Рабочий

In [109]:
sample.query('City in ["Рига", "Сочи","Чебоксары", "Сургут"] &                     \
             21<Age<50 & Profession!="Менеджер"')

     Name    City  Age Profession
6   Сажин  Сургут   29    Рабочий
10   Фикс    Рига   42    Рабочий

С помощью функции query найдите тех, у кого ставка меньше 2000, а выигрыш больше 0. Сохраните в новый датафрейм log2.

In [113]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log2 = log.query('bet < 2000 & win > 0')

Функции str.match и str.contains  
Часто приходится фильтровать значения в столбце по соответствию строке или её части. Для этого есть две полезные функции:

str.match ("abc") — ищет строки, которые начинаются c abc,  
str.contains ("abc") — ищет строки, в которых есть abc.  
Обе функции не могут работать с NaN, необходимо использовать параметр na = False:

In [114]:
sample.Name.str.match("К", na=False)

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7      True
8     False
9     False
10    False
Name: Name, dtype: bool

In [115]:
sample[sample.Name.str.match("К", na=False)]

           Name        City  Age Profession
5      Кузнецов        Сочи   19    Рабочий
7  Котлеревский  Йошкар-Ола   32    Рабочий

In [116]:
sample[~sample.Name.str.match("К", na=False)]

          Name         City  Age Profession
0       Иванов       Москва   25     Клинер
1          NaN    Волгоград   31   Менеджер
2       Иванов       Москва   25     Клинер
3      sidorov  Владивосток   43   Менеджер
4      _______        Курск   50   Водитель
6        Сажин       Сургут   29    Рабочий
8   Завалишина    Чебоксары   36   Менеджер
9       Левина          NaN   55    Рабочий
10        Фикс         Рига   42    Рабочий

Найдите записи, где в городах есть буква «о», и сохраните в переменную sample3.

Функция contains не может работать с пустыми значениями: необходимо использовать параметр na = False

In [120]:
sample = pd.read_csv("sample.csv")
sample3 = sample[sample.City.str.contains('о', na=False)]

Найдите записи, где в городах нет буквы "о", и сохраните в переменную sample4. Не забудьте про NaN и параметр na:

In [133]:
sample = pd.read_csv("sample.csv")
sample4 = sample[~sample.City.str.contains('о', na=False)]

In [134]:
sample4

       Name    City  Age Profession
4   _______   Курск   50   Водитель
6     Сажин  Сургут   29    Рабочий
9    Левина     NaN   55    Рабочий
10     Фикс    Рига   42    Рабочий

Сохраните в переменную new_log датафрейм, из которого удалены записи с ошибкой в поле user_id:

In [138]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
new_log = log[~log.user_id.str.contains('error', na = False)]

In [139]:
new_log

,user_id,time,bet,win
0,Запись пользователя № - user_919,[2019-01-01 14:06:51,NaN,NaN
1,Запись пользователя № - user_973,[2019-01-01 14:51:16,NaN,NaN
2,Запись пользователя № - user_903,[2019-01-01 16:31:16,NaN,NaN
3,Запись пользователя № - user_954,[2019-01-01 17:17:51,NaN,NaN
4,Запись пользователя № - user_954,[2019-01-01 21:31:18,NaN,NaN
5,Запись пользователя № - user_917,[2019-01-01 23:34:55,156789.0,NaN
6,Запись пользователя № - user_900,[2019-01-01 4:37:25,NaN,NaN
7,Запись пользователя № - user_980,[2019-01-01 6:31:23,NaN,NaN
8,Запись пользователя № - user_906,[2019-01-02 10:57:08,NaN,NaN
9,Запись пользователя № - user_952,[2019-01-02 16:55:06,NaN,NaN
10,Запись пользователя № - user_972,[2019-01-02 20:47:54,NaN,NaN
11,Запись пользователя № - user_966,[2019-01-02 21:32:20,NaN,NaN
12,Запись пользователя № - user_964,[2019-01-02 21:32:35,NaN,NaN
13,Запись пользователя № - user_978,[2019-01-02 5:25:40,NaN,NaN
14,Запись пользователя № - user_917,[2019-01-02 8:57:36,145732.0,1987653.0
15,Запись пользователя № - user_968,[2019-01-02 9:32:24,NaN,NaN
16,Запись пользователя № - user_974,[2019-01-03 10:43:41,NaN,NaN
17,Запись пользователя № - user_998,[2019-01-03 11:29:08,NaN,NaN
18,Запись пользователя № - user_990,[2019-01-03 13:12:46,NaN,NaN
19,Запись пользователя № - user_942,[2019-01-03 14:03:21,98753.0,NaN
20,Запись пользователя № - user_929,[2019-01-03 17:20:23,NaN,NaN
21,Запись пользователя № - user_976,[2019-01-03 18:24:25,NaN,NaN
22,Запись пользователя № - user_927,[2019-01-03 18:45:54,NaN,NaN
23,Запись пользователя № - user_998,[2019-01-03 2:48:25,NaN,NaN
24,Запись пользователя № - user_951,[2019-01-03 5:30:43,NaN,NaN
25,Запись пользователя № - user_949,[2019-01-03 5:49:42,NaN,NaN
26,Запись пользователя № - user_976,[2019-01-04 1:59:34,NaN,NaN
27,Запись пользователя № - user_987,[2019-01-04 11:50:21,NaN,NaN
28,Запись пользователя № - user_976,[2019-01-04 12:49:31,NaN,NaN
29,Запись пользователя № - user_942,[2019-01-04 13:59:42,1678321.0,9876543.0
...,...,...,...,...
955,Запись пользователя № - user_967,[2019-04-18 19:43:51,200.0,5213.0
956,Запись пользователя № - user_910,[2019-04-18 2:34:52,104540.0,NaN
957,Запись пользователя № - user_981,[2019-04-18 22:41:27,1000.0,NaN
958,Запись пользователя № - user_995,[2019-04-18 4:33:31,9954.0,NaN
959,Запись пользователя № - user_929,[2019-04-18 7:35:02,1000.0,NaN
960,Запись пользователя № - user_938,[2019-04-18 8:06:43,9954.0,NaN
961,Запись пользователя № - user_950,[2019-04-18 8:14:24,1000.0,6072.0
962,Запись пользователя № - user_976,[2019-04-19 14:18:45,400.0,5997.0
963,Запись пользователя № - user_983,[2019-04-19 16:03:17,400.0,NaN
964,Запись пользователя № - user_926,[2019-04-19 17:29:36,600.0,NaN
965,Запись пользователя № - user_900,[2019-04-19 19:31:48,900.0,6767.0
966,Запись пользователя № - user_940,[2019-04-19 20:34:13,10754.0,32279.0
967,Запись пользователя № - user_975,[2019-04-19 22:25:15,1000.0,6108.0
968,Запись пользователя № - user_912,[2019-04-19 5:29:34,700.0,NaN
969,Запись пользователя № - user_963,[2019-04-19 8:58:07,800.0,NaN
970,Запись пользователя № - user_991,[2019-04-20 1:18:20,700.0,NaN
971,Запись пользователя № - user_912,[2019-04-20 10:35:49,10554.0,31799.0
972,Запись пользователя № - user_926,[2019-04-20 10:35:50,10354.0,30244.0
973,Запись пользователя № - user_904,[2019-04-20 10:35:51,600.0,NaN
974,Запись пользователя № - user_987,[2019-04-20 10:35:52,9754.0,NaN
975,Запись пользователя № - user_913,[2019-04-20 10:35:53,10754.0,NaN
976,Запись пользователя № - user_970,[2019-04-20 10:35:54,10354.0,30691.0
984,Запись пользователя № - user_925,[2019-04-20 12:55:00,1000.0,NaN
989,Запись пользователя № - user_953,[2019-04-20 12:55:39,9954.0,NaN
990,Запись пользователя № - user_954,[2019-04-20 12:55:40,9854.0,NaN
991,Запись пользователя № - user_965,[2019-04-20 12:55:41,800.0,6927.0
992,Запись пользователя № - user_967,[2019-04-20 14:59:36,10154.0,NaN
993,Запись пользователя № - user_973,[2019-04-20 17:09:56,10254.0,NaN
994,Запись пользователя № - user_977,[2019-04-20 18:10:07,10354.0,NaN
995,Запись пользователя № - user_984,[2019-04-20 9:59:58,9754.0,NaN